{
    "data": [
        {
            "id": 1,
            "documentId": "fqo1h0out7mhbu3510at2l4x",
            "recommendation": "This Meiji-era onsen offers a retro atmosphere and a unique sand bath experience. Staff gently cover you with warm sand, providing a pleasantly warm sensation. It's a memorable and traditional Japanese bathing experience. ",
            "kmFromStay": null,
            "weightInNearbyRestaurants": 0,
            "weightInNearbyAttractions": 0,
            "weightInHighlight": 0,
            "poi": {
                "id": 15,
                "documentId": "ay4mg0bs3x2bxba901uhtanm",
                "slug": "Takegawara-Onsen",
                "label": "Takegawara Onsen",
                "address": "16-23 Motomachi, Beppu-shi, Oita 874-0944, Japan",
                "highlight": "Takegawara Onsen is one of Beppu City's most iconic traditional public hot springs, housed in a highly historic old building. The building itself is over a hundred years old, serving as a symbol of Beppu's hot spring culture and considered a city landmark.\n\nBeyond classic Japanese hot spring baths, its most famous feature is the \"\"sand bath\"\" (sunayu) – where visitors lie in warm sand heated by natural geothermal steam, experiencing a healing effect different from regular bathing. It's deeply loved by both domestic and international travelers.\n\nAs a place where history and culture intersect, Takegawara Onsen is not just a bathing spot but also a journey through time, highly recommended for first-time visitors to Beppu.",
                "externalURL": "https://www.takegawara-onsen.com/",
                "type": "attraction",
                "tag_labels": [
                    {
                        "id": 2,
                        "documentId": "cfq91726e76i6u7ywdblwsnn",
                        "name": " Onsen (Hot Spring)",
                        "color": "GREY"
                    },
                    {
                        "id": 5,
                        "documentId": "y0fm6ubj5q6j89tv7xchn360",
                        "name": "Top Attractions",
                        "color": "GREY"
                    }
                ],
                "coverPhoto": {
                    "id": 61,
                    "documentId": "cuwoxz5swpqikoe2n5p1kmse",
                    "url": "https://res.cloudinary.com/dui2mxeuh/image/upload/v1749993261/Takegawara_Onsen_ae85d80840.jpg"
                }
            }
        },
        {
            "id": 2,
            "documentId": "cdemz0jtzqzijqkioptpa5fm",
            "recommendation": "This is one of the best onsens we have in downtown Beppu. It's only 3 minutes walking distance from your place and costs you only 250 yen. There are nothing prepared in the onsen so you have to bring the towel, shampoo, etc from our apartment. :) Please try the yogurt drink they sell after onsen, because it's the best, lol. (Please don't forget to bring the towel back). ",
            "kmFromStay": null,
            "weightInNearbyRestaurants": 0,
            "weightInNearbyAttractions": 0,
            "weightInHighlight": 0,
            "poi": {
                "id": 17,
                "documentId": "zbyhe0y7k0w2ma9h1538lab9",
                "slug": "Kaimonji-Onsen",
                "label": "Kaimonji Onsen",
                "address": "2-3-2 Kitahama, Beppu-shi, Oita 874-0920, Japan",
                "highlight": "Kaimonji Onsen is a historic public hot spring in Beppu City, Oita Prefecture, Japan. It's affordable and popular among locals and tourists, making it an ideal choice for those who want to experience authentic Japanese bathing culture.\n\nThe onsen retains a traditional and simple style, not luxurious but full of warmth and nostalgia. The facilities are modest, suitable for travelers who prefer a quiet and pure hot spring experience. Its central location near Beppu Station makes it easily accessible on foot.\n\nIf you want to delve into Beppu's daily life and hot spring culture, Kaimonji Onsen is a worthwhile addition to your itinerary.",
                "externalURL": "https://www.city.beppu.oita.jp/sisetu/shieionsen/detail7.html",
                "type": "attraction",
                "tag_labels": [
                    {
                        "id": 2,
                        "documentId": "cfq91726e76i6u7ywdblwsnn",
                        "name": " Onsen (Hot Spring)",
                        "color": "GREY"
                    }
                ],
                "coverPhoto": {
                    "id": 20,
                    "documentId": "bn0d6ekn7kb3kd07g07srb2d",
                    "url": "https://res.cloudinary.com/dui2mxeuh/image/upload/v1749993120/Kaimonji_Onsen_bdf2f3eabf.webp"
                }
            }
        },
        {
            "id": 3,
            "documentId": "lpo90tb4pgei3cfzi4qu8o9c",
            "recommendation": "This is the time when Beppu's largest hot spring festival is held. Annually, it takes place over five days, usually from around March 30th to April 3rd (the exact dates may vary slightly each year). During this period, you can enjoy a festive atmosphere in various parts of Beppu City.\n\nThe biggest highlight is that all municipal hot springs are opened to the public for free! Additionally, there's a \"mountain burning\" event where an entire mountain is set ablaze, praying for good health and prosperity throughout the year.",
            "kmFromStay": null,
            "weightInNearbyRestaurants": 0,
            "weightInNearbyAttractions": 1,
            "weightInHighlight": 0,
            "poi": {
                "id": 26,
                "documentId": "c7j2oppvcojte9if27e22xue",
                "slug": "Beppu-Hatto-Onsen-Festival",
                "label": "Beppu Hatto Onsen Festival (Late March–Early April)",
                "address": null,
                "highlight": "The Beppu Hatto Onsen Festival is the largest hot spring festival in the area, typically lasting five days from late March to early April. During this period, many municipal hot springs offer free admission, and the entire town is filled with a joyous atmosphere. The festivities include parades, traditional performances, and the unique \"\"Yu-Kake Matsuri\"\" (Hot Water Splashing Festival), where participants splash hot spring water onto the crowd, creating an incredibly lively scene.\n\nAnother unique event is the Ogiyama Fire Festival, a ceremony where fires are set on Mount Ogiyama to pray for health, longevity, and prosperity throughout the year. However, please note that this fire festival usually takes place in early February, on a different date from the Onsen Festival, and is a spectacular sight unique to Beppu's winter.",
                "externalURL": null,
                "type": "attraction",
                "tag_labels": [
                    {
                        "id": 1,
                        "documentId": "xd02cfhqrxhr35klrjghebhi",
                        "name": "Event",
                        "color": "GREY"
                    }
                ],
                "coverPhoto": {
                    "id": 70,
                    "documentId": "su3ta56s79trfrd2nu3n6hsd",
                    "url": "https://res.cloudinary.com/dui2mxeuh/image/upload/v1749993291/Beppu_Hatto_Onsen_Festival_a9473eeefc.jpg"
                }
            }
        },
        {
            "id": 4,
            "documentId": "yc90mvlgxhe5vpota6hx1eas",
            "recommendation": "Renowned for its crispy and tender tonkatsu (pork cutlet). The generous portions and quality ingredients make it a standout. A must-try for fans of Japanese comfort food. ​ ",
            "kmFromStay": null,
            "weightInNearbyRestaurants": 0,
            "weightInNearbyAttractions": 0,
            "weightInHighlight": -1,
            "poi": {
                "id": 10,
                "documentId": "wq5ru3gyazxqyv3zel38jv70",
                "slug": "Tonkichi-Pork-Cutlet-Restaurant",
                "label": "Tonkichi, Pork Cutlet Restaurant",
                "address": "4-38 Funakojimachi, Beppu, Oita 874-0922, Japan",
                "highlight": "Tonkatsu Tei is a popular Japanese tonkatsu (pork cutlet) specialty restaurant located in Hiji-machi, Hayami-gun, Oita Prefecture, renowned for its crispy exterior and juicy, thick-cut pork cutlets. The tonkatsu here is prepared with meticulous craftsmanship, resulting in a perfectly crispy outside and tender inside. Paired with a rich special sauce and served fresh, it receives consistent praise from both locals and tourists.\n\nThe interior is simple and inviting, with seating areas perfect for family meals or a stop during a road trip. Besides the classic tonkatsu set meal, they offer various options like miso tonkatsu, cheese tonkatsu, and fried seafood. The side dishes, rice, and miso soup are also thoughtfully prepared, making it a restaurant that leaves you feeling full and satisfied.\n\nGiven its location near the midpoint between Beppu and Yufuin, it's an ideal spot for a lunch stop during your itinerary.",
                "externalURL": null,
                "type": "restaurant",
                "tag_labels": [
                    {
                        "id": 4,
                        "documentId": "g5i2tgti48fgebp6rlauo6ci",
                        "name": "Food & Drink",
                        "color": "GREY"
                    }
                ],
                "coverPhoto": {
                    "id": 30,
                    "documentId": "krzmra0m4y3q56q0qghmd8ug",
                    "url": "https://res.cloudinary.com/dui2mxeuh/image/upload/v1749993153/Tonkichi_Pork_Cutlet_Restaurant_96b3b8190d.webp"
                }
            }
        },
        {
            "id": 5,
            "documentId": "iyw10rslycmv2ehlqunsfw33",
            "recommendation": "When it comes to hotels and hot springs in Beppu, Suginoi Hotel is probably the most famous. Guests who stay here are generally very satisfied. The only issue is the price even at its cheapest, it costs around 120,000 KRW per night per person, and during peak season it can go up to 400,000 KRW. For a family of four, it’s not hard to spend over 1.5 million KRW.\n\nHowever, there’s a way to enjoy both Suginoi’s rooftop onsen “Tanayu and the heated pool “Aqua Garden at a lower cost. Many people don’t know this, but even if you’re not staying at the hotel, you can still use these facilities by paying a separate entrance fee. Adults can enter for 1,200 yen (1,800 yen on weekends), and children aged 3 to elementary school age can enter for 700 yen (1,100 yen on weekends).\n\nThere’s a free shuttle bus from Beppu Station’s west exit that runs about every 15 minutes, and if you're driving, there’s also free parking available. In the evenings at 8, 9, 10, and 11 PM, there’s a spectacular laser show, and the hotel area is beautifully lit by geothermal powered illuminations that perfect for evening photos.",
            "kmFromStay": null,
            "weightInNearbyRestaurants": 0,
            "weightInNearbyAttractions": 0,
            "weightInHighlight": 0,
            "poi": {
                "id": 19,
                "documentId": "hjcj7rzrritadxa3c3cmrgjg",
                "slug": "Suginoi-Hotel-Aqua-Garden",
                "label": "Suginoi Hotel, Aqua Garden",
                "address": "1 Kankaiji, Beppu-shi, Oita 874-0822, Japan",
                "highlight": "The Aqua Garden is a renowned spa and water park located within Beppu Suginoi Hotel, combining hot spring therapy with a resort atmosphere to offer guests an excellent relaxation experience. Facilities include open-air hot spring pools, illuminated fountains, waterfall walls, and visual effects, making it ideal for couples and families, as well as travelers who enjoy a romantic nighttime ambiance.\n\nVisitors don't need to stay at Suginoi Hotel to purchase tickets for entry, making it popular among day-trippers. Especially at night, the illuminations and water performances, accompanied by background music, create a rare and fantastical scene in Beppu, making it a popular choice for photography and unwinding.",
                "externalURL": "https://www.suginoi-hotel.com/",
                "type": "attraction",
                "tag_labels": [
                    {
                        "id": 2,
                        "documentId": "cfq91726e76i6u7ywdblwsnn",
                        "name": " Onsen (Hot Spring)",
                        "color": "GREY"
                    }
                ],
                "coverPhoto": {
                    "id": 28,
                    "documentId": "fh1ususq0aqyits1nm12k08d",
                    "url": "https://res.cloudinary.com/dui2mxeuh/image/upload/v1749993148/Suginoi_Hotel_Aqua_Garden_9183456676.jpg"
                }
            }
        },
        {
            "id": 6,
            "documentId": "sztyjnxmari8esrsqhxjtg95",
            "recommendation": "This isn’t a must-visit gourmet spot, but in Beppu, where it can be hard to find breakfast options that it’s valuable as a 24-hour place.\nIt’s just a 5-minute walk from your accommodation, and the menu is extensive, so if you want to have a proper breakfast, this is a good choice.",
            "kmFromStay": null,
            "weightInNearbyRestaurants": 0,
            "weightInNearbyAttractions": 0,
            "weightInHighlight": -1,
            "poi": {
                "id": 9,
                "documentId": "ufvfj53ool114vx4qoajv07p",
                "slug": "Gusto-Family-Restaurant",
                "label": "ガスト 別府店",
                "address": "5-23 Minamikitamachō, Beppu, Oita 874-0929, Japan",
                "highlight": "Gusto Beppu Store is a branch of the well-known Japanese family restaurant chain Gusto located in Beppu. This restaurant offers a diverse menu, ranging from Japanese to Western dishes, including hamburg steaks, pasta, salads, and various desserts. It's a great place for locals and tourists to enjoy a casual meal, whether it's breakfast, lunch, or dinner. The restaurant typically has long operating hours, catering to different dining needs and providing a comfortable and convenient dining environment. You can enjoy delicious and affordable family-style cuisine here.",
                "externalURL": "https://www.skylark.co.jp/gusto/?utm_source=gt&utm_medium=gmb&utm_campaign=brandtop-Oita",
                "type": "restaurant",
                "tag_labels": [
                    {
                        "id": 4,
                        "documentId": "g5i2tgti48fgebp6rlauo6ci",
                        "name": "Food & Drink",
                        "color": "GREY"
                    }
                ],
                "coverPhoto": {
                    "id": 54,
                    "documentId": "v3pgajqtu70x5o79o2hro4mp",
                    "url": "https://res.cloudinary.com/dui2mxeuh/image/upload/v1749993239/Gusto_Family_Restaurant_e599f80ef5.jpg"
                }
            }
        },
        {
            "id": 7,
            "documentId": "ygz4f9zcv7qn7zka972zlrgj",
            "recommendation": "A cozy eatery offering okonomiyaki and home-style Japanese dishes. Praised for its friendly service and authentic flavors. A great place to experience local cuisine. ",
            "kmFromStay": null,
            "weightInNearbyRestaurants": 0,
            "weightInNearbyAttractions": 0,
            "weightInHighlight": -1,
            "poi": {
                "id": 18,
                "documentId": "jib9rnnskq6upziyoqrcy20w",
                "slug": "Miyako",
                "label": "Miyako",
                "address": "7-4 Motomachi, Beppu, Oita 874-0944, Japan",
                "highlight": "Aji Dining Miyako is a cozy izakaya located in the heart of Beppu City, known for its home-style cooking and Japanese teppanyaki dishes. The affordable prices make it an excellent choice for enjoying good food and casual gatherings.\n\nThe restaurant is situated inside the \"\"Sol Paseo Ginza\"\" commercial building, offering convenient access. The dine-in environment is clean, comfortable, and has a relaxed atmosphere. The menu is extensive, ranging from classic Japanese side dishes to freshly grilled okonomiyaki, making it especially suitable for travelers wanting to experience an authentic Japanese dinner.",
                "externalURL": null,
                "type": "restaurant",
                "tag_labels": [
                    {
                        "id": 4,
                        "documentId": "g5i2tgti48fgebp6rlauo6ci",
                        "name": "Food & Drink",
                        "color": "GREY"
                    }
                ],
                "coverPhoto": {
                    "id": 65,
                    "documentId": "lgncb5nepp8m2sme3xsfnskr",
                    "url": "https://res.cloudinary.com/dui2mxeuh/image/upload/v1749993274/Miyako_3465e2547c.jpg"
                }
            }
        },
        {
            "id": 8,
            "documentId": "w8juezzycgun0tjllzv3cu24",
            "recommendation": "A popular izakaya known for its delicious char-grilled dishes. Highlights include beef and amberjack fish head. The lively atmosphere makes it a favorite among locals and tourists alike. ",
            "kmFromStay": null,
            "weightInNearbyRestaurants": 0,
            "weightInNearbyAttractions": 0,
            "weightInHighlight": -1,
            "poi": {
                "id": 6,
                "documentId": "c719oonijgcgt626kq8fdcix",
                "slug": "Robata-Jin",
                "label": "Robata Jin",
                "address": "1-15-7 Kitahama, Beppu, Oita 874-0920, Japan",
                "highlight": "Robata Jin is a cozy Japanese izakaya located in Kitahama, Beppu City, cherished by locals and travelers alike for its friendly service and warm atmosphere. The establishment offers a diverse selection of alcoholic beverages, including beer, sake, and shochu, paired with various delicious side dishes.\n\nThe cuisine primarily features tempura and fresh seafood dishes, making it perfect whether you want to enjoy a few drinks or spend a relaxed time with friends and family. It provides dine-in service only and does not support takeout, offering a space suitable for sitting down and slowly savoring the izakaya experience.",
                "externalURL": "http://robata-jin.com/",
                "type": "restaurant",
                "tag_labels": [
                    {
                        "id": 4,
                        "documentId": "g5i2tgti48fgebp6rlauo6ci",
                        "name": "Food & Drink",
                        "color": "GREY"
                    }
                ],
                "coverPhoto": {
                    "id": 62,
                    "documentId": "cmxjsspjlcpa681n2l8nsm52",
                    "url": "https://res.cloudinary.com/dui2mxeuh/image/upload/v1749993265/Robata_Jin_7347b0a438.jpg"
                }
            }
        },
        {
            "id": 9,
            "documentId": "g1dcfl7avlm56zcjg55mg1d5",
            "recommendation": "Specializes in yakitori (grilled chicken skewers) with a variety of options. The casual setting and flavorful dishes make it a must-visit for meat lovers. ",
            "kmFromStay": null,
            "weightInNearbyRestaurants": 0,
            "weightInNearbyAttractions": 0,
            "weightInHighlight": -1,
            "poi": {
                "id": 7,
                "documentId": "ryy1jnppo9wybvmp70ech7am",
                "slug": "Yakitori-Bon",
                "label": "Yakitori-Bon",
                "address": "1-1-11 Kitahama, Beppu, Oita 874-0920, Japan",
                "highlight": "Yakitori Bon Omocha is a highly popular Japanese yakitori izakaya located in the Kitahama area of Beppu City. The restaurant features horigotatsu (sunken floor) seating and private rooms, offering an elegant and private atmosphere, perfect for gatherings with friends or a relaxing drink.\n\nThe highlight of the menu is the fragrant charcoal-grilled skewers (yakitori), complemented by a variety of fresh seafood dishes and small appetizers. In addition to delicious food, they offer a rich selection of local sake and shochu, satisfying guests with discerning tastes. It's an excellent place to experience authentic Japanese izakaya culture.",
                "externalURL": "http://www.yakitoribon.com/",
                "type": "restaurant",
                "tag_labels": [
                    {
                        "id": 4,
                        "documentId": "g5i2tgti48fgebp6rlauo6ci",
                        "name": "Food & Drink",
                        "color": "GREY"
                    }
                ],
                "coverPhoto": {
                    "id": 68,
                    "documentId": "jthi0uk1t3mn2ih8vig77jqg",
                    "url": "https://res.cloudinary.com/dui2mxeuh/image/upload/v1749993284/Yakitori_Bon_7f6349f1d9.jpg"
                }
            }
        },
        {
            "id": 10,
            "documentId": "x6rmzcbbyy4exizeasek46cr",
            "recommendation": "This ramen shop is about a 10-minute walk from your accommodation.\nThey serve tonkotsu ramen, but without the usual pork smell that it’s clean and delicious.\nPersonally, I recommend the vegetable ramen. I've never had a guest disappointed after visiting.\n(Check it out on the Beppu Airbnb blog)\nhttps://blog.naver.com/beppu-airbnb/221189815570",
            "kmFromStay": null,
            "weightInNearbyRestaurants": 0,
            "weightInNearbyAttractions": 0,
            "weightInHighlight": -1,
            "poi": {
                "id": 5,
                "documentId": "rc804d2del0mxnd6yah50v5x",
                "slug": "Fukuya-Ramen",
                "label": "Fukuya Ramen",
                "address": "8-16 Kyōmachi, Beppu, Oita 874-0926, Japan",
                "highlight": "Located in Kyomachi, Beppu City, \"\"Ramen Kobo Fukuya Main Store\"\" is a long-established ramen specialty shop renowned for its authentic taste and rich tonkotsu (pork bone) broth. The exterior is modest and unassuming, while the interior features a simple yet comfortable Japanese design with a friendly atmosphere, making it a daily dining favorite for many locals and regulars.\n\nThis store adheres to traditional methods for simmering its tonkotsu broth, resulting in a rich aroma that is flavorful but not greasy. Paired with springy medium-thin noodles, it delivers a classic Kyushu ramen with abundant flavor. In addition to the standard option, they also offer vegetable ramen, extra chashu versions, and spicy variations to satisfy various diners' preferences.\n\nThe shop provides dine-in seating and also offers takeout service, making it ideal for a quick and hot bowl of ramen during a busy travel itinerary. Whether chosen for lunch or dinner, this place can provide a satisfying bowl of hot ramen.",
                "externalURL": "https://fukuya-ramen.com/",
                "type": "restaurant",
                "tag_labels": [
                    {
                        "id": 4,
                        "documentId": "g5i2tgti48fgebp6rlauo6ci",
                        "name": "Food & Drink",
                        "color": "GREY"
                    }
                ],
                "coverPhoto": {
                    "id": 19,
                    "documentId": "e5agzobomj3a6u58h7iz9sgp",
                    "url": "https://res.cloudinary.com/dui2mxeuh/image/upload/v1749993117/Fukuya_Ramen_60448ac175.jpg"
                }
            }
        },
        {
            "id": 11,
            "documentId": "isu7ps10ec3y3tzfxakty8pa",
            "recommendation": "A historic bakery famous for its soft and flavorful bread. Popular items include anpan (red bean bun) and butter rolls. Expect a line, but it's worth the wait. ",
            "kmFromStay": null,
            "weightInNearbyRestaurants": 0,
            "weightInNearbyAttractions": 0,
            "weightInHighlight": -1,
            "poi": {
                "id": 24,
                "documentId": "ni2f8rqmz4p31j41wfw7cqba",
                "slug": "Tomonaga-Bakery",
                "label": "Tomonaga Bakery",
                "address": "2-29 Chiyomachi, Beppu, Oita 874-0942, Japan",
                "highlight": "Founded over a century ago, Tomonaga Bakery is one of Beppu's oldest and most popular long-established bakeries. Since its establishment in the Taisho era, the shop has consistently adhered to traditional baking methods and its own refined recipes, bringing simple yet heartwarming handmade bread to every customer.\n\nIts most popular products include the classic red bean bread (tsubuan-pan) and butter French bread. The fillings are not overly sweet, and the texture is soft and elastic, attracting a steady stream of loyal customers. Both locals and tourists often queue up early in the morning just to get their hands on freshly baked, piping hot bread.\n\nThe shop only offers takeout; there are no dine-in seats or delivery services. Due to limited quantities, popular items often sell out by morning, so it's recommended to go early to avoid disappointment.",
                "externalURL": "https://www.instagram.com/tomonaga_panya/",
                "type": "restaurant",
                "tag_labels": [
                    {
                        "id": 4,
                        "documentId": "g5i2tgti48fgebp6rlauo6ci",
                        "name": "Food & Drink",
                        "color": "GREY"
                    }
                ],
                "coverPhoto": {
                    "id": 64,
                    "documentId": "baw7gjiq544l4i112urpxs0f",
                    "url": "https://res.cloudinary.com/dui2mxeuh/image/upload/v1749993271/Tomonaga_Bakery_4f3a049426.jpg"
                }
            }
        },
        {
            "id": 12,
            "documentId": "f09aintojoqdgfuy19fdc28d",
            "recommendation": null,
            "kmFromStay": null,
            "weightInNearbyRestaurants": 0,
            "weightInNearbyAttractions": 0,
            "weightInHighlight": -1,
            "poi": {
                "id": 23,
                "documentId": "ta9w6rsuey2dq5giwvjymqmm",
                "slug": "Taiichi-Shoten-Ramen-Restaurant",
                "label": "Taiichi Shoten, Ramen Restaurant",
                "address": "Kitachū, Beppu, Oita 874-0845, Japan",
                "highlight": "Taichi Shoten Beppu Yamanami Store is a popular ramen shop located in Kita-naka, Beppu City, favored by gourmets for its generous portions and rich broth, characteristic of Jiro-kei ramen. The store design is simple and practical, with spacious seating suitable for solo diners or friends looking to enjoy a hearty bowl of noodles together.\n\nThe broth is pork bone-based, infused with a rich soy sauce flavor, making it rich in fat but not greasy. The noodles are thick and curly, offering excellent elasticity, and are paired with a generous amount of bean sprouts, cabbage, and thick-cut chashu, providing a highly satisfying meal. You can also customize your ramen by adding extra garlic, back fat (seabura), or increasing the portion size according to your preference.\n\nAdditionally, the shop offers takeout service and is one of the must-visit establishments for ramen lovers who enjoy strong flavors and a feeling of fullness.",
                "externalURL": "http://taichi-shouten.com/",
                "type": "restaurant",
                "tag_labels": [
                    {
                        "id": 4,
                        "documentId": "g5i2tgti48fgebp6rlauo6ci",
                        "name": "Food & Drink",
                        "color": "GREY"
                    }
                ],
                "coverPhoto": {
                    "id": 60,
                    "documentId": "bxcel738a2au9zqf61p7ka67",
                    "url": "https://res.cloudinary.com/dui2mxeuh/image/upload/v1749993258/Taiichi_Shoten_Ramen_Restaurant_2e028bdbb9.jpg"
                }
            }
        },
        {
            "id": 13,
            "documentId": "ggdg58lya8zch2xrc1ub65t5",
            "recommendation": "Offers a conveyor belt sushi experience with fresh and delicious options. Free-flowing miso soup and green tea are available. Be prepared for a wait during peak hours. ​ ",
            "kmFromStay": null,
            "weightInNearbyRestaurants": 0,
            "weightInNearbyAttractions": 0,
            "weightInHighlight": -1,
            "poi": {
                "id": 25,
                "documentId": "b0awrv0nz4o9jx05w2g2bfqa",
                "slug": "Kamesho-Sushi-Restaurant",
                "label": "Kamesho, Sushi Restaurant ",
                "address": "34 Tsurumi, Beppu, Oita 874-0840, Japan",
                "highlight": "Kame Masa Kurukuru Sushi is a highly popular conveyor belt sushi restaurant located in the Tsurumi area of Beppu City, renowned for its fresh and generously portioned sushi ingredients. Each piece of sushi here is made with ample ingredients and expertly cut, providing not only fresh taste but also visual satisfaction, making it a must-revisit spot for many locals and tourists.\n\nThe interior decor is minimalist, featuring counter seats and spacious family-style booth seating, suitable for both solo dining and family gatherings. The variety of plates is extensive, from classic tuna, salmon, and squid to daily fresh seafood, all easily enjoyed via the conveyor belt or by ordering directly from the chef.\n\nThis restaurant does not offer delivery service, but dine-in and takeout are available. Due to its extreme popularity, queuing is often required during peak hours, so it's advisable to arrive early or plan for an earlier dining time.",
                "externalURL": "https://instagram.com/kamesho_9696_sushi",
                "type": "restaurant",
                "tag_labels": [
                    {
                        "id": 4,
                        "documentId": "g5i2tgti48fgebp6rlauo6ci",
                        "name": "Food & Drink",
                        "color": "GREY"
                    }
                ],
                "coverPhoto": {
                    "id": 53,
                    "documentId": "vbqclj7f6fnfr58wetno9q8f",
                    "url": "https://res.cloudinary.com/dui2mxeuh/image/upload/v1749993236/Kamesho_Sushi_Restaurant_43a2b77d65.jpg"
                }
            }
        },
        {
            "id": 14,
            "documentId": "rioj7xtte9duy59488673uwh",
            "recommendation": "Experience cooking your own food using natural hot spring steam. A fun and interactive way to enjoy local ingredients. The steamed dishes are both healthy and flavorful. ",
            "kmFromStay": null,
            "weightInNearbyRestaurants": 0,
            "weightInNearbyAttractions": 0,
            "weightInHighlight": -1,
            "poi": {
                "id": 27,
                "documentId": "he4j08woj4a9xa8951wr185e",
                "slug": "Jigoku-Steam-Food",
                "label": "Jigoku Steam Food",
                "address": "5 Kumi, Furomoto, Beppu, Oita 874-0041, Japan",
                "highlight": "Jigokumushi Kobo Kannawa is a famous experiential local cuisine restaurant in Beppu, renowned for its Jigokumushi Ryori (hell-steamed cuisine), which utilizes natural hot spring steam for cooking. This cooking method has been passed down since the Edo period, involving placing vegetables, seafood, meats, and other ingredients into a steamer basket and cooking them directly with high-temperature steam erupting from underground, without adding a single drop of oil or water, preserving the ingredients' original flavor and nutrients.\n\nThe Kobo offers two ways to experience it: you can choose from the set menus provided on-site, or you can bring your own ingredients for DIY steaming (a facility usage fee applies). The hands-on experience is both fun and memorable, making it a popular unique Beppu activity for families, friends, and couples.\n\nThe restaurant has a spacious dining area, but it does not offer takeout or delivery services. Located in the heart of the Kannawa Onsen area, it's easily accessible and a must-try local dining experience when visiting Beppu.",
                "externalURL": "http://jigokumushi.com/",
                "type": "restaurant",
                "tag_labels": [
                    {
                        "id": 4,
                        "documentId": "g5i2tgti48fgebp6rlauo6ci",
                        "name": "Food & Drink",
                        "color": "GREY"
                    }
                ],
                "coverPhoto": {
                    "id": 17,
                    "documentId": "gx4ei6tx9t03gg9rndbpsipc",
                    "url": "https://res.cloudinary.com/dui2mxeuh/image/upload/v1749993110/Jigoku_Steam_Food_5036f0ebc7.jpg"
                }
            }
        },
        {
            "id": 15,
            "documentId": "qxlohlevz1explpizllk1pj9",
            "recommendation": "A multi-story discount store offering a wide range of products. Great for souvenirs, snacks, and everyday items. ",
            "kmFromStay": null,
            "weightInNearbyRestaurants": 0,
            "weightInNearbyAttractions": 0,
            "weightInHighlight": -1,
            "poi": {
                "id": 14,
                "documentId": "k43jal69ybwqggeyuh7x5plr",
                "slug": "Don-Quijote-Beppu",
                "label": "Don Quijote Beppu ",
                "address": "6-20 Minamikitamachō, Beppu, Oita 874-0929, Japan",
                "highlight": "Don Quijote Beppu Store is one of Japan's famous discount chain stores, located in the heart of Beppu City. It offers a vast array of products, making it a highly popular and convenient shopping destination for tourists and local residents alike.\n\nThe store is packed with an extensive range of items, from snacks, daily necessities, cosmetics, home appliances, toys, to travel goods, clothing, footwear, souvenirs, and almost everything in between. Its unique shelf layout makes you feel like you're in a labyrinth, with every visit leading to new discoveries, making the shopping experience full of fun.\n\nThis store is particularly popular among international visitors, featuring a permanent tax-free counter and offering multilingual signage and friendly service. If you want to purchase everything you need for your trip in one go or find affordable surprise treasures, this is definitely one of the must-visit options.",
                "externalURL": "https://www.donki.com/store/shop_detail.php?shop_id=650",
                "type": "attraction",
                "tag_labels": [
                    {
                        "id": 3,
                        "documentId": "n1fasfi52e6y59v8id9eimde",
                        "name": "Shopping",
                        "color": "GREY"
                    }
                ],
                "coverPhoto": {
                    "id": 33,
                    "documentId": "b26zl95p6yx9h2497yl2xnhu",
                    "url": "https://res.cloudinary.com/dui2mxeuh/image/upload/v1749993163/Don_Quijote_Beppu_bc0d8ce926.webp"
                }
            }
        },
        {
            "id": 16,
            "documentId": "an2vgmjggr5w3twg3vub26lo",
            "recommendation": "A shopping mall with various retail stores, restaurants, and a supermarket. Convenient for all your shopping needs. ",
            "kmFromStay": null,
            "weightInNearbyRestaurants": 0,
            "weightInNearbyAttractions": 0,
            "weightInHighlight": -1,
            "poi": {
                "id": 16,
                "documentId": "u7dzshg6ndcfbqn4lostzltw",
                "slug": "YouMe-Town",
                "label": "YouMe Town",
                "address": "382-7 Kusunoki-machi, Beppu, Oita 874-0943, Japan",
                "highlight": "YouMe Town Beppu is one of the largest multi-purpose shopping centers in Beppu City. It brings together a diverse range of stores, including supermarkets, clothing, cosmetics, bookstores, game centers, restaurants, and lifestyle goods, providing a one-stop shopping and leisure experience for both local residents and tourists.\n\nThe mall spans several floors. The 1st floor features a large supermarket and a general merchandise area, convenient for purchasing daily necessities and souvenirs. The 2nd floor primarily showcases apparel brands and 100-yen shops like DAISO. The 3rd floor houses UNIQLO, a bookstore, a children's play area, and a food court, making it convenient for shopping, dining, or visiting with children.\n\nIts location near the Beppu city center offers easy access, with free parking available, or you can walk or take public transportation. Whether you want to quickly stock up on daily essentials or spend a leisurely afternoon, this is an excellent choice.",
                "externalURL": "http://www.izumi.jp/tenpo/beppu",
                "type": "attraction",
                "tag_labels": [
                    {
                        "id": 3,
                        "documentId": "n1fasfi52e6y59v8id9eimde",
                        "name": "Shopping",
                        "color": "GREY"
                    }
                ],
                "coverPhoto": {
                    "id": 67,
                    "documentId": "lyvotngq6b8coryziudxxe1o",
                    "url": "https://res.cloudinary.com/dui2mxeuh/image/upload/v1749993280/You_Me_Town_1942a0f995.jpg"
                }
            }
        },
        {
            "id": 17,
            "documentId": "l5czot5ynsv0dczsdgzmzsga",
            "recommendation": "Meet wild Japanese macaques in their natural habitat at this unique zoo. You can watch them freely roaming around the mountain paths and platforms. The monkeys are used to humans and are fun to observe, especially during feeding times. It's an educational and entertaining stop for kids and adults alike. Only a short bus ride from Beppu city center. ",
            "kmFromStay": null,
            "weightInNearbyRestaurants": 0,
            "weightInNearbyAttractions": 0,
            "weightInHighlight": -1,
            "poi": {
                "id": 13,
                "documentId": "buj1fyygg1np66jit4b0is97",
                "slug": "Takasaki-Mountain-Monkey-Park",
                "label": "Takasaki Mountain, Monkey Park",
                "address": "3098-1 Kanzaki, Oita, Oita 870-0802, Japan",
                "highlight": "Takasakiyama Natural Zoo is a natural animal park focusing on wild macaques (Japanese macaques), located in the Kanzaki area of Oita City. It's one of Kyushu's most representative outdoor attractions for families. The monkey troops live in their natural mountain forest habitat, allowing visitors to observe their natural behavior up close and experience the harmonious coexistence between humans and animals.\n\nKnown for its barrier-free design, the monkeys roam freely within the park, are very lively, and unafraid of people. Besides observing their lives, the park also arranges scheduled feeding sessions with explanations, helping visitors understand the monkeys' habits and group behavior, making it especially popular with families and nature enthusiasts.\n\nThe park includes ticket booths, a simple souvenir shop, and an information exhibition space, making it an ideal venue for educational tourism. It is adjacent to the Oita Marine Palace Aquarium Umitamago, allowing for a half-day to full-day combined sightseeing itinerary.",
                "externalURL": "http://www.takasakiyama.jp/takasakiyama/",
                "type": "attraction",
                "tag_labels": [
                    {
                        "id": 5,
                        "documentId": "y0fm6ubj5q6j89tv7xchn360",
                        "name": "Top Attractions",
                        "color": "GREY"
                    }
                ],
                "coverPhoto": {
                    "id": 59,
                    "documentId": "sl3agayy164c9neg14tzwe0n",
                    "url": "https://res.cloudinary.com/dui2mxeuh/image/upload/v1749993255/Takasaki_Mountain_Monkey_Park_7563ebf6b2.jpg"
                }
            }
        },
        {
            "id": 18,
            "documentId": "yk8wxb6rl1wqud1ruct2onda",
            "recommendation": "Located in the Yayoi shopping arcade, this Tengu statue is a quirky photo spot. Adds a touch of local folklore to your shopping experience. ​ ",
            "kmFromStay": null,
            "weightInNearbyRestaurants": 0,
            "weightInNearbyAttractions": 0,
            "weightInHighlight": -1,
            "poi": {
                "id": 3,
                "documentId": "nkd2ej5kim0rc9kkf0c90ws6",
                "slug": "Yayoi-Tengu",
                "label": "Yayoi Tengu",
                "address": "1-1-21 Kitahama, Beppu, Oita 874-0920, Japan",
                "highlight": "Yayoi Tengu is a distinctive landmark statue located at the entrance of Yayoi Shopping Street in Kitahama, Beppu City. Shaped like a giant Tengu mask (a mythical guardian of mountains and forests in Japanese folklore), it symbolizes warding off evil and protection. This statue is not only a symbol of local belief but also a popular photo spot for visitors to Beppu.\n\nThe Tengu's prominent nose and stern expression are said to represent masculine power and blessings. Many tourists pose in front of or beside it, and it takes on a more mysterious aura when illuminated at night. It's rumored that some hidden Easter eggs can be found by observing the statue from behind, adding an element of playful discovery for visitors.\n\nConveniently located near Beppu Station, it also connects to Yayoi Shopping Street, once a bustling shopping area for locals. Although it no longer draws the crowds it once did, this Tengu statue quietly guards Beppu's street corners and memories, making it a cultural landmark not to be missed during a stroll.",
                "externalURL": null,
                "type": "attraction",
                "tag_labels": [
                    {
                        "id": 6,
                        "documentId": "cbe1blfqovxzr7wnb3dce3c8",
                        "name": "Strolling",
                        "color": "GREY"
                    }
                ],
                "coverPhoto": {
                    "id": 29,
                    "documentId": "xymbmct90lzww2chxijcpq9v",
                    "url": "https://res.cloudinary.com/dui2mxeuh/image/upload/v1749993150/Yayoi_Tengu_0cfbb6be33.avif"
                }
            }
        },
        {
            "id": 19,
            "documentId": "r3nirdp1537ofb2srpamuorr",
            "recommendation": "A seaside park offering a relaxing environment with ocean views. Ideal for a leisurely walk or a picnic by the beach. ",
            "kmFromStay": null,
            "weightInNearbyRestaurants": 0,
            "weightInNearbyAttractions": 0,
            "weightInHighlight": -1,
            "poi": {
                "id": 20,
                "documentId": "qjxyx38759qbkxcvw0rzwshe",
                "slug": "Matogahama-Park",
                "label": "Matogahama Park",
                "address": "5 Kitamatogahamachō, Beppu, Oita 874-0928, Japan",
                "highlight": "Matogahama Park is an open public park located in Kitano-hamacho, Beppu City, right by the coast. It boasts expansive views and a serene atmosphere, making it a beloved spot for strolls and relaxation among locals and tourists.\n\nFacing Beppu Bay, the park features a coastal promenade, ideal for morning jogs, evening walks, or enjoying sunrises and ocean views. The wide, flat grounds are lush with greenery, making it a perfect place for dog walking, picnics, and for children to play freely. Crucially, pets are welcome, making it very friendly for travelers with furry companions.\n\nIts proximity to the city center and the seaside allows easy walking access to various hot spring facilities and dining establishments, making it a convenient location that integrates with Beppu's everyday life. Whether it's the morning sea breeze or the evening tranquility, you can feel Beppu's unique laid-back charm here.",
                "externalURL": null,
                "type": "attraction",
                "tag_labels": [
                    {
                        "id": 6,
                        "documentId": "cbe1blfqovxzr7wnb3dce3c8",
                        "name": "Strolling",
                        "color": "GREY"
                    }
                ],
                "coverPhoto": {
                    "id": 56,
                    "documentId": "hkspxp7htf4ig2pslswgye80",
                    "url": "https://res.cloudinary.com/dui2mxeuh/image/upload/v1749993244/Matogahama_Park_ca14f9cc40.jpg"
                }
            }
        },
        {
            "id": 20,
            "documentId": "mk5pmntu30bmrncmcuxxi0lz",
            "recommendation": "A modern and beautifully designed aquarium by the sea. Features dolphins, sea lions, jellyfish, and interactive exhibits for children. The dolphin show is a favorite among visitors that fun and well-choreographed. It also includes a petting area where you can touch starfish and small marine creatures. Great for families or anyone who enjoys marine life. ",
            "kmFromStay": null,
            "weightInNearbyRestaurants": 0,
            "weightInNearbyAttractions": 0,
            "weightInHighlight": -1,
            "poi": {
                "id": 28,
                "documentId": "uyj91g2qym0hfs9s78jvhk7u",
                "slug": "Umitamago-Aquarium",
                "label": "Umitamago, Aquarium",
                "address": "3078-22 Kanzaki, Oita, Oita 870-0100, Japan",
                "highlight": "Oita Marine Palace Aquarium Umitamago is a large aquarium located on the coast of the Kanzaki area in Oita Prefecture. It focuses on marine life exhibits and interactive experiences, making it one of Kyushu's popular destinations for family travel. The aquarium is known for its innovative architectural appearance and diverse exhibition spaces, and it is committed to combining entertainment with marine education to create an engaging and educational visitor experience.\n\nThe museum houses a rich collection of exhibits, including various marine creatures such as tropical fish, penguins, sea lions, dolphins, and stingrays. Visitors can enjoy thrilling sea lion and dolphin shows, and even touch starfish and shellfish in the touch pool, which is very popular with children and families.\n\nThe aquarium features a souvenir shop, a cafe area, and an outdoor scenic promenade, making it a comprehensive leisure facility suitable for all-day visits. Outside the building is a coastal promenade that connects to the nearby Takasakiyama Natural Zoo, allowing for a combined half-day to full-day tour itinerary.",
                "externalURL": "https://www.umitamago.jp/",
                "type": "attraction",
                "tag_labels": [
                    {
                        "id": 5,
                        "documentId": "y0fm6ubj5q6j89tv7xchn360",
                        "name": "Top Attractions",
                        "color": "GREY"
                    }
                ],
                "coverPhoto": {
                    "id": 21,
                    "documentId": "q5qia9ektjm2ga5mnhccyxdt",
                    "url": "https://res.cloudinary.com/dui2mxeuh/image/upload/v1749993124/Umitamago_Aquarium_26c789b8a4.webp"
                }
            }
        },
        {
            "id": 21,
            "documentId": "yyovr7ipuqhszio96ih8h518",
            "recommendation": "Drive through a safari park and see lions, elephants, giraffes, and more up close. You can either take your own car or join the Jungle Bus with open windows for feeding animals. It feels like a mini Africa in Japan exciting and family-friendly. There’s also a walking area with smaller animals and petting zones. Highly recommended for animal lovers and adventurous travelers. ",
            "kmFromStay": null,
            "weightInNearbyRestaurants": 0,
            "weightInNearbyAttractions": 0,
            "weightInHighlight": -1,
            "poi": {
                "id": 2,
                "documentId": "lxxj4eydfyx81d25fx4623yv",
                "slug": "African-Safari",
                "label": "African Safari",
                "address": "2-1755-1 Minamihatsu, Ajimu-machi, Usa, Oita 872-0722, Japan",
                "highlight": "Kyushu Natural Zoological Park, also known as African Safari, is a vast wild animal park located in Usa City, Oita Prefecture. It features an African savanna-style animal ecosystem with free-roaming animals, making it a must-visit highlight for families and animal lovers.\n\nThe park's main feature is the Jungle Bus, an armored cage bus that allows close-up observation of animals like lions, elephants, giraffes, zebras, and camels along a dedicated route. Visitors can even feed the animals by hand, providing an immersive and interactive wildlife experience. In addition to the Jungle Bus, there are also walking areas and a small petting zoo, suitable for leisurely visits by all ages.\n\nThe park includes shops, dining areas, and convenient parking. It also offers shuttle services to and from Oita City and Beppu City, making it an ideal destination for a day trip with family or group tours.",
                "externalURL": "https://africansafari.co.jp/",
                "type": "attraction",
                "tag_labels": [
                    {
                        "id": 5,
                        "documentId": "y0fm6ubj5q6j89tv7xchn360",
                        "name": "Top Attractions",
                        "color": "GREY"
                    }
                ],
                "coverPhoto": {
                    "id": 31,
                    "documentId": "ujmkkbhq0cas90iajt1asgjm",
                    "url": "https://res.cloudinary.com/dui2mxeuh/image/upload/v1749993156/African_Safari_0b2a57df5a.jpg"
                }
            }
        },
        {
            "id": 22,
            "documentId": "y17ikretp33jwfqnysd3jqsg",
            "recommendation": "A spacious park in the city center, perfect for relaxation and recreation. Features seasonal flowers and walking paths. ",
            "kmFromStay": null,
            "weightInNearbyRestaurants": 0,
            "weightInNearbyAttractions": 0,
            "weightInHighlight": -1,
            "poi": {
                "id": 30,
                "documentId": "ukfqzkoowvkcpqcorzthjnou",
                "slug": "Beppu-Park",
                "label": "Beppu Park",
                "address": "3018-1 Beppu, Beppu, Oita 874-0903, Japan",
                "highlight": "Beppu Park is the largest urban green space in the heart of Beppu City, sprawling with diverse scenery that changes with the seasons. It's a popular spot for locals and visitors to relax, exercise in the morning, and enjoy family strolls. The park features vast lawns, bamboo groves, pine tree pathways, and in spring, blooming cherry blossoms and plum trees, making it an ideal place for photography and flower viewing.\n\nBesides its natural beauty, the park is frequently used as a venue for local events and festivals, creating a lively atmosphere during festive periods, while remaining tranquil and serene on weekdays. It's a great place to immerse yourself in Beppu's lifestyle. The park's pathways are gentle and easy to navigate, suitable for jogging, dog walking, picnics, or simply resting under the shade of trees.\n\nBeppu Park is open year-round without fences and allows dogs, making it very pet-friendly. Its central location near the city provides convenient access, allowing you to experience the comfortable blend of nature and urban life at any time of day.",
                "externalURL": "http://www.city.beppu.oita.jp/sisetu/kouen_tyuusyajyou/03kouen_03-01beppu.html",
                "type": "attraction",
                "tag_labels": [
                    {
                        "id": 6,
                        "documentId": "cbe1blfqovxzr7wnb3dce3c8",
                        "name": "Strolling",
                        "color": "GREY"
                    },
                    {
                        "id": 5,
                        "documentId": "y0fm6ubj5q6j89tv7xchn360",
                        "name": "Top Attractions",
                        "color": "GREY"
                    }
                ],
                "coverPhoto": {
                    "id": 34,
                    "documentId": "w8a1ixjs7esonbfebnlrb0sm",
                    "url": "https://res.cloudinary.com/dui2mxeuh/image/upload/v1749993166/Beppu_Park_9c3ec76d96.jpg"
                }
            }
        },
        {
            "id": 23,
            "documentId": "viuss3emxl2tejgslie86t3g",
            "recommendation": "A serene Shinto shrine nestled in nature. Offers a peaceful atmosphere and beautiful architecture. ",
            "kmFromStay": null,
            "weightInNearbyRestaurants": 0,
            "weightInNearbyAttractions": 0,
            "weightInHighlight": -1,
            "poi": {
                "id": 22,
                "documentId": "jd9fe7zsk035bjm6x5n5ap4f",
                "slug": "Asami-Shrine",
                "label": "Asami Shrine",
                "address": "2-15-19 Asami, Beppu, Oita 874-0812, Japan",
                "highlight": "\"Hachiman Asami Shrine is one of Beppu City's oldest and largest shrines, boasting over a thousand years of history. It is a solemn sanctuary dedicated to Hachiman-okami. Nestled at the foot of Mount Asami, it has long been a spiritual center where locals pray for health, safety, and family harmony.\n\nThe shrine grounds exude a peaceful atmosphere, surrounded by lush greenery. The architecture is rustic and elegant, with torii gates, stone lanterns, sacred bridges, and the main hall all bearing the marks of time. In spring, when the cherry blossoms bloom, the entire shrine becomes even more romantic and serene, making it an excellent spot for flower viewing and photography.\n\nFurthermore, there is a spring here known as the Water of Longevity, a famous natural spring that many locals specially come to draw water from. Whether for sightseeing, worship, or a tranquil stroll for introspection, Hachiman Asami Shrine is an ideal place to deeply explore Beppu's history and culture.\"",
                "externalURL": "http://www.asami.or.jp/",
                "type": "attraction",
                "tag_labels": [
                    {
                        "id": 6,
                        "documentId": "cbe1blfqovxzr7wnb3dce3c8",
                        "name": "Strolling",
                        "color": "GREY"
                    }
                ],
                "coverPhoto": {
                    "id": 32,
                    "documentId": "mjqr2uqo8dnjjiao94f4xut8",
                    "url": "https://res.cloudinary.com/dui2mxeuh/image/upload/v1749993159/Asami_Shrine_e8e00db78f.jpg"
                }
            }
        },
        {
            "id": 24,
            "documentId": "ntdkvzhrqe0880rqjzu9jh7c",
            "recommendation": "A scenic beach area ideal for swimming and sunbathing. Enjoy the coastal views and gentle waves. ",
            "kmFromStay": null,
            "weightInNearbyRestaurants": 0,
            "weightInNearbyAttractions": 0,
            "weightInHighlight": -1,
            "poi": {
                "id": 29,
                "documentId": "ndibwc6kzg3gud9w03qwrde6",
                "slug": "Tanoura-Beach",
                "label": "Tanoura Beach",
                "address": "4253 Kanzaki, Oita, Oita 870-0100, Japan",
                "highlight": "Tanoura Beach is a popular coastal spot located in the Kanzaki area of Oita City, known for its tranquil and pleasant atmosphere and convenient facilities. It features an artificially constructed gently sloping sandy beach and a breakwater, suitable for strolling, playing in the water, and enjoying magnificent sunset views in the evening.\n\nOpposite the beach is a small artificial island park, easily accessible via a pedestrian bridge. The island is equipped with children's play equipment and seating, making it a popular place for families and couples to stroll and take photos. The promenade along the coast is flat and easy to walk, providing an ideal space for jogging, walking pets, and unwinding.\n\nDuring summer, the beach is open for public swimming, with clean water suitable for fishing and observing small creatures. Basic facilities like restrooms and showers are also available. This area is also pet-friendly, making it a welcoming beach option for dog lovers.",
                "externalURL": "https://www.city.oita.oita.jp/o177/tanoura_syoukai.html",
                "type": "attraction",
                "tag_labels": [
                    {
                        "id": 6,
                        "documentId": "cbe1blfqovxzr7wnb3dce3c8",
                        "name": "Strolling",
                        "color": "GREY"
                    }
                ],
                "coverPhoto": {
                    "id": 58,
                    "documentId": "tl28tf13q1itbjqacl9a6wnw",
                    "url": "https://res.cloudinary.com/dui2mxeuh/image/upload/v1749993253/Tanoura_Beach_d51055ed51.jpg"
                }
            }
        },
        {
            "id": 25,
            "documentId": "ifrwtcg8mfj3y0ageemxld4q",
            "recommendation": "Shidaka Lake is a peaceful spot surrounded by mountains and trees that perfect for a relaxing day out. You can rent a boat, walk around the lake, or enjoy a picnic with a beautiful view. The calm, natural setting makes it ideal for couples, families, or solo travelers. It’s especially stunning in spring with cherry blossoms and in autumn with colorful leaves. A hidden gem for anyone looking to unwind in nature. ",
            "kmFromStay": null,
            "weightInNearbyRestaurants": 0,
            "weightInNearbyAttractions": 0,
            "weightInHighlight": -1,
            "poi": {
                "id": 4,
                "documentId": "ojprcnuzd2onbyvkfnqpf95l",
                "slug": "Shidaka-Lake",
                "label": "Shidaka Lake",
                "address": "4380-1 Higashiyamabeppu, Beppu, Oita 874-0000, Japan",
                "highlight": "Shidaka Lake is a highland lake located in the mountainous area of Beppu City, Oita Prefecture. Surrounded by mountains, its lake and mountain scenery complement each other beautifully, making it a hidden gem that combines natural beauty with recreational facilities. The climate here is pleasant year-round, with cherry blossoms in spring and autumn leaves, offering different charms each season.\n\nThe lakeside area is well-developed, featuring camping grounds, BBQ facilities, paddleboat rentals, hiking trails, and family-friendly amenities, making it a great place for locals and tourists to relax on holidays. Those who prefer quiet nature can fish or picnic by the lake, while travelers seeking outdoor activities can plan a day of camping or hiking.\n\nThe lake area boasts fresh air and still, mirror-like waters. It's especially recommended to visit in the early morning or evening to capture stunning reflections and picturesque scenes where the lake blends with mist.",
                "externalURL": "https://www.recamp.co.jp/recamp%E5%88%A5%E5%BA%9C%E5%BF%97%E9%AB%98%E6%B9%96",
                "type": "attraction",
                "tag_labels": [
                    {
                        "id": 6,
                        "documentId": "cbe1blfqovxzr7wnb3dce3c8",
                        "name": "Strolling",
                        "color": "GREY"
                    }
                ],
                "coverPhoto": {
                    "id": 66,
                    "documentId": "tdq1qt2it4ia84ohr8nf4ub0",
                    "url": "https://res.cloudinary.com/dui2mxeuh/image/upload/v1749993277/Shidaka_Lake_cc66655f32.jpg"
                }
            }
        },
        {
            "id": 26,
            "documentId": "zrye4vm58kewzmsqd6302084",
            "recommendation": "Explore the famous “Hells of Beppu, unique hot spring spots with boiling ponds and steam vents. Each “Jigoku has a distinct color and atmosphere, like the cobalt-blue Umi Jigoku or red Chinoike. You’ll see bubbling mud, geysers, and even crocodiles in one of the areas. A must-see for first-time visitors to Beppu. Don’t forget your camera. The sights are surreal and memorable! ",
            "kmFromStay": null,
            "weightInNearbyRestaurants": 0,
            "weightInNearbyAttractions": 0,
            "weightInHighlight": -1,
            "poi": {
                "id": 31,
                "documentId": "f4fwpb81h7i0fqrbgosmkdh6",
                "slug": "Jigoku-Hell-Tour",
                "label": "Jigoku Hell Tour",
                "address": "559-1 Kannawa, Beppu, Oita 874-0000, Japan",
                "highlight": "The Beppu Hells Tour is one of Beppu's most iconic sightseeing routes, combining hot spring viewing with cultural themes to create a unique visual and sensory experience. Unlike typical hot springs focused on bathing, the Hells Tour is centered on observing the spectacular wonders of hot springs, featuring multiple distinct hells that allow visitors to fully appreciate the mystery and grandeur of geothermal activity.\n\nThe Hells Tour encompasses eight main hot spring attractions: Umi Jigoku (Sea Hell), Chinoike Jigoku (Blood Pond Hell), Oniyama Jigoku (Demon Mountain Hell), Shiraike Jigoku (White Pond Hell), Tatsumaki Jigoku (Spout Hell), Yama Jigoku (Mountain Hell), Onishi Bouzu Jigoku (Demon Stone Monk Hell), and Kamado Jigoku (Cooking Pot Hell). Each location offers different geothermal phenomena and exhibits; some are vivid red like blood, others are deep blue like the sea. There are even crocodile breeding areas and geothermal steaming food experiences, making it a diverse sightseeing route that blends nature with culture.\n\nSome hells are a bit far apart, so it's recommended to use city buses or drive. You can also purchase a Hells Tour pass to visit all eight at a discounted price. It's suitable for a half-day to full-day in-depth tour.",
                "externalURL": "https://www.beppu-jigoku.com/",
                "type": "attraction",
                "tag_labels": [
                    {
                        "id": 5,
                        "documentId": "y0fm6ubj5q6j89tv7xchn360",
                        "name": "Top Attractions",
                        "color": "GREY"
                    }
                ],
                "coverPhoto": {
                    "id": 16,
                    "documentId": "z8iyfrx4xc70tni8fu6z30i8",
                    "url": "https://res.cloudinary.com/dui2mxeuh/image/upload/v1749993107/Jigoku_Hell_Tour_e70335560f.jpg"
                }
            }
        },
        {
            "id": 27,
            "documentId": "s3c7gi3jh1wuy86gu4u9t6b9",
            "recommendation": "Many visitors to Beppu also plan a trip to Yufuin.\nIt's a lovely place with beautiful nature and charming little shops, perfect for a relaxing stroll.\nHowever, shops usually open around 10 AM and close around 5 PM, so if you’re not planning to stay in a luxurious ryokan to enjoy a kaiseki dinner and hot springs, an overnight stay may not be necessary.\n\nWhether by bus or train, the route usually starts at Yufuin Station.\nIf you're driving, it's better to park near Lake Kinrinko. There are parking lots nearby and some are 300 yen for a whole day, but those farther out may cost 500 yen or more.\nThe typical walking course goes from Yufuin Station to Lake Kinrinko and back.\nFamous treats include B-Speak roll cake and the Kinsho croquette.\n\nFrom Beppu, the cheapest, fastest, and most convenient way to get there is by bus.\nBuses depart from Beppu Station West Exit about once or twice an hour.\nYou can check the bus schedule here:\nhttp://www.kamenoibus.com/data/kamenoibus_rosen_yufuin.pdf",
            "kmFromStay": null,
            "weightInNearbyRestaurants": 0,
            "weightInNearbyAttractions": 0,
            "weightInHighlight": -1,
            "poi": {
                "id": 11,
                "documentId": "z5ftr8chb861ij88uz9jkgp0",
                "slug": "Yufuin",
                "label": "Yufuin",
                "address": "Yufuin Onsen, Yufu, Oita, Japan",
                "highlight": "Yufuin is a renowned hot spring town located in Oita Prefecture, adjacent to Beppu, yet it presents a distinctly different charm. Compared to Beppu's bustling atmosphere, Yufuin is known for its serene elegance, artistic ambiance, and natural beauty, making it an ideal destination for relaxation and romance.\n\nAlong Yunotsubo Kaido, the central street of the town, various unique boutiques, art galleries, cafes, and specialty restaurants line the path, perfect for a leisurely stroll and treasure hunting. The most famous landmark is undoubtedly Lake Kinrinko, where the misty surface in the early morning combined with the lakeside scenery creates a picturesque view. Furthermore, Yufuin is surrounded by the majestic Mount Yufu, offering abundant outdoor activities and spectacular natural landscapes. Traditional Japanese ryokans (inns) here are also renowned for their refined service and private onsen experiences, making it a popular choice for escaping the hustle and bustle and enjoying a high-quality vacation.",
                "externalURL": null,
                "type": "attraction",
                "tag_labels": [
                    {
                        "id": 5,
                        "documentId": "y0fm6ubj5q6j89tv7xchn360",
                        "name": "Top Attractions",
                        "color": "GREY"
                    }
                ],
                "coverPhoto": {
                    "id": 57,
                    "documentId": "r8yr6omq6mjffvln9ip3blnk",
                    "url": "https://res.cloudinary.com/dui2mxeuh/image/upload/v1749993249/Yufuin_990fc54861.jpg"
                }
            }
        },
        {
            "id": 28,
            "documentId": "ei0v8kxm0tfy13hv7ai23yrj",
            "recommendation": "Located at a higher elevation, this observatory offers one of the best panoramic views of Beppu. You can see the entire city, Beppu Bay, and even Mount Tsurumi on a clear day. It’s a great place to enjoy sunrise or sunset that very peaceful and photogenic. There’s ample parking and space to sit and relax with the view. Perfect for ending your day with a breathtaking scenic moment. ",
            "kmFromStay": null,
            "weightInNearbyRestaurants": 0,
            "weightInNearbyAttractions": 0,
            "weightInHighlight": -1,
            "poi": {
                "id": 21,
                "documentId": "wwzn6fi6olvnxqwcds45r21p",
                "slug": "Jyumonjibaru-Observatory",
                "label": "Jyumonjibaru Observatory",
                "address": "1200 Noda Aza Ikenotsuru, Beppu, Oita 874-0016, Japan",
                "highlight": "Jumonji-hara Observatory is located on a high plateau north of Beppu City, offering a superb panoramic view of the entire Beppu city area and Beppu Bay. It is also listed as one of Japan's Top 100 Viewpoints. The expansive view allows you to see as far as Shikoku on clear days, making it a must-visit spot for photography and nature enthusiasts.\n\nIt is especially recommended to visit in the evening to witness the romantic scene of the sunset and the city lights illuminating. The night view is also incredibly charming, showcasing another side of Beppu as a hot spring city. As the observatory is open around the clock, those driving can choose their visiting time to avoid crowds and quietly enjoy the magnificent landscape where mountains meet the sea.",
                "externalURL": "https://www.city.beppu.oita.jp/sisetu/sangyou_kankou/jumonjibaru.html",
                "type": "attraction",
                "tag_labels": [
                    {
                        "id": 7,
                        "documentId": "fakk0mv2t9ckbl11cnd4m2s8",
                        "name": "Observatories",
                        "color": "GREY"
                    }
                ],
                "coverPhoto": {
                    "id": 18,
                    "documentId": "mniby0xjcvkqkz3gin1n9r94",
                    "url": "https://res.cloudinary.com/dui2mxeuh/image/upload/v1749993113/Jyumonjibaru_Observatory_3ddbe13a55.jpg"
                }
            }
        },
        {
            "id": 29,
            "documentId": "ny9fojhgdzv0yvs4paln6mm5",
            "recommendation": "This free observatory offers a panoramic view of Beppu’s famous onsen steam rising from the town. It's especially beautiful in the early morning or evening when the steam is more visible. You can also see the sea and cityscape in the background. There’s a small parking area and benches for a quiet break. A short stop, but a memorable photo spot! ",
            "kmFromStay": null,
            "weightInNearbyRestaurants": 0,
            "weightInNearbyAttractions": 0,
            "weightInHighlight": -1,
            "poi": {
                "id": 8,
                "documentId": "wn13m48m8jo1ngqgrjubqou2",
                "slug": "Yukemuri-Observatory",
                "label": "Yukemuri Observatory",
                "address": "8 Kumi, Kannawa, Beppu, Oita 874-0041, Japan",
                "highlight": "The Yukemuri Observatory is located in the Kannawa area of Beppu City, offering an excellent vantage point to admire the spectacular scenery of Beppu's hot spring town. From the observatory, you can see hot spring steam (yukemuri) rising from the ground and wafting through the streets, creating a geothermal city landscape full of everyday charm and historical atmosphere, especially captivating at dawn and dusk.\n\nThis spot is not only ideal for photography enthusiasts and sightseers but also a recommended starting point for understanding Beppu's hot spring culture. On clear days, you can also gaze at Beppu Bay and the surrounding mountain views from afar, making it a popular stop for many visitors before or after their Hells Tour.\n\nFor those driving, the observatory has parking available; it can also be combined with a visit to the nearby famous Kame Masa Sushi restaurant.",
                "externalURL": "https://www.city.beppu.oita.jp/sisetu/sangyou_kankou/yukemuri.html",
                "type": "attraction",
                "tag_labels": [
                    {
                        "id": 7,
                        "documentId": "fakk0mv2t9ckbl11cnd4m2s8",
                        "name": "Observatories",
                        "color": "GREY"
                    }
                ],
                "coverPhoto": {
                    "id": 63,
                    "documentId": "k4n3yokyb1jvs0k994ws1ci3",
                    "url": "https://res.cloudinary.com/dui2mxeuh/image/upload/v1749993268/Yukemuri_Observatory_f7f1e74717.jpg"
                }
            }
        },
        {
            "id": 30,
            "documentId": "xi4di0hpxw8fepvst0verqz7",
            "recommendation": "A large-scale summer festival is held in Beppu City every year on the last Friday, Saturday, and Sunday of July. Numerous food stalls line three locations in the city center, where you can enjoy delicious street food and drinks.\n\nOn the final day, Sunday, there's a parade of traditional Japanese dance that lasts approximately two hours. From 8:00 PM, a fireworks display lights up the night sky for about an hour. It's truly a spectacular sight! This period is also one of the times when accommodation prices in Beppu are at their highest throughout the year.",
            "kmFromStay": null,
            "weightInNearbyRestaurants": 0,
            "weightInNearbyAttractions": 0,
            "weightInHighlight": 2,
            "poi": {
                "id": 1,
                "documentId": "rnmkx5dp1q18a54vl94sdf6y",
                "slug": "Beppu-Summer-Fireworks-Festival",
                "label": "Beppu Summer Fireworks Festival (Late July)",
                "address": null,
                "highlight": "Beppu City holds a grand Summer Festival on the last weekend of July each year. This three-day event is a major local celebration, bringing a lively festive atmosphere to Beppu.\n\nDuring the festival, numerous food stalls (yatai) will be set up in the city center, offering a variety of delicious street foods and drinks, allowing locals and tourists to fully enjoy the food and fun.\n\nThe climax of the event falls on Sunday, with a approximately two-hour traditional Japanese dance parade. The most anticipated part is the Beppu Bay Fireworks Display, starting around 8 PM and lasting about an hour, where brilliant fireworks light up the night sky, creating a spectacular scene. Due to the large crowds attracted by the festival, accommodation prices in Beppu during this period are usually among the most expensive of the year, so early planning is recommended.",
                "externalURL": null,
                "type": "attraction",
                "tag_labels": [
                    {
                        "id": 1,
                        "documentId": "xd02cfhqrxhr35klrjghebhi",
                        "name": "Event",
                        "color": "GREY"
                    }
                ],
                "coverPhoto": {
                    "id": 69,
                    "documentId": "kxk09w1udkblszwicsuxeu08",
                    "url": "https://res.cloudinary.com/dui2mxeuh/image/upload/v1749993288/Beppu_Summer_Fireworks_Festival_8220adcb80.jpg"
                }
            }
        },
        {
            "id": 31,
            "documentId": "xnupr0rtkiynbti83ju7bd0w",
            "recommendation": "Over two days, on the Saturday and Sunday of Christmas week, Beppu hosts a winter festival and fireworks display. Unlike the single day of fireworks at the summer festival in late July, the winter event features fireworks on two consecutive days.\n\nAt the venue, you can enjoy delicious food stall gourmet and drinks, ensuring a fun time. Accommodation fills up quickly, so early booking, even two months in advance, is highly recommended.",
            "kmFromStay": null,
            "weightInNearbyRestaurants": 0,
            "weightInNearbyAttractions": 0,
            "weightInHighlight": -1,
            "poi": {
                "id": 12,
                "documentId": "hm5m7axp9xl437e9shjpjaeo",
                "slug": "Enjoy-Christmas-in-Beppu",
                "label": "Enjoy Christmas in Beppu (December)",
                "address": null,
                "highlight": "Beppu hosts a grand winter festival, Beppu Christmas Hanabi Fantasia, on the Saturday and Sunday of Christmas week. This two-day event is a major highlight of Beppu's winter season.\n\nUnlike the Summer Festival's fireworks in late July, which are held for only one day, this fireworks display lights up Beppu's night sky for two consecutive evenings, making the scenery exceptionally charming and spectacular. The event venue features numerous food stalls (yatai), offering a variety of delicious snacks and drinks, allowing visitors to enjoy the festive atmosphere while indulging in local treats.\n\nDue to the popularity of this winter extravaganza, accommodations in Beppu city tend to fill up quickly. Therefore, it is strongly recommended that travelers planning to attend book their accommodation at least two months in advance to ensure they can fully participate in this romantic and spectacular Christmas fireworks feast.",
                "externalURL": null,
                "type": "attraction",
                "tag_labels": [
                    {
                        "id": 1,
                        "documentId": "xd02cfhqrxhr35klrjghebhi",
                        "name": "Event",
                        "color": "GREY"
                    }
                ],
                "coverPhoto": {
                    "id": 71,
                    "documentId": "h3p1f5ldu14ztktlppexvuje",
                    "url": "https://res.cloudinary.com/dui2mxeuh/image/upload/v1749993294/Enjoy_Christmas_in_Beppu_5d77d68805.jpg"
                }
            }
        }
    ],
    "meta": {
        "pagination": {
            "page": 1,
            "pageSize": 10000,
            "pageCount": 1,
            "total": 31
        }
    }
}